<a href="https://colab.research.google.com/github/TapanManu/Applied-ML-NoteBook/blob/master/Shops.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

## Some Basic Processing with Series and DataFrame

In [0]:
Shop_1={'Name':'Tapan',
        'Item':'Maggie'}
s=pd.Series(Shop_1)
s

Name     Tapan
Item    Maggie
dtype: object

In [0]:
Names=['Tapan','Prithvi','Raj','Lal']
name = pd.Series(Names,index=['A','B','C','D'])
name

A      Tapan
B    Prithvi
C        Raj
D        Lal
dtype: object

In [0]:
Num=[1,2,3,None]
nums = pd.Series(Num,index=['1','2','3','4'])
nums

1    1.0
2    2.0
3    3.0
4    NaN
dtype: float64

In [0]:
Shop_2={'Name':'Fahad',
        'Item':'Yippee',
        'Price':80.0}
shops = pd.DataFrame([Shop_1,Shop_2],index=['shop 1','shop 2'])
shops

         Name    Item  Price
shop 1  Tapan  Maggie    NaN
shop 2  Fahad  Yippee   80.0

In [0]:
shops.loc['shop 1',['Price']]=40.0
shops

         Name    Item  Price
shop 1  Tapan  Maggie   40.0
shop 2  Fahad  Yippee   80.0
0         NaN     NaN   40.0

In [0]:
shops.drop(0,axis=0,inplace=True)
shops

         Name    Item  Price
shop 1  Tapan  Maggie   40.0
shop 2  Fahad  Yippee   80.0

In [0]:
shops.loc[:,['Name']]=['Tapan','Toms']
shops

         Name    Item  Price
shop 1  Tapan  Maggie   40.0
shop 2   Toms  Yippee   80.0

In [0]:
shops.loc[:,['Name']]

         Name
shop 1  Tapan
shop 2   Toms

In [0]:
shops.Price-=0.5*shops.Price
shops

         Name    Item  Price
shop 1  Tapan  Maggie   20.0
shop 2   Toms  Yippee   40.0

In [0]:
shops.loc['shop 3']=['Aby','Chineese',30.0]
shops

         Name      Item  Price
shop 1  Tapan    Maggie   20.0
shop 2   Toms    Yippee   40.0
shop 3    Aby  Chineese   30.0

In [0]:
shops.index

Index(['shop 1', 'shop 2', 'shop 3'], dtype='object')

In [0]:
shops.index.values

array(['shop 1', 'shop 2', 'shop 3'], dtype=object)

In [0]:
shops.values

array([['Tapan', 'Maggie', 20.0],
       ['Toms', 'Yippee', 40.0],
       ['Aby', 'Chineese', 30.0]], dtype=object)

In [0]:
shops.keys

<bound method NDFrame.keys of          Name      Item  Price
shop 1  Tapan    Maggie   20.0
shop 2   Toms    Yippee   40.0
shop 3    Aby  Chineese   30.0>

In [0]:
shops.columns.values

array(['Name', 'Item', 'Price'], dtype=object)

In [0]:
shops[(shops['Price']>25)]  #Sample Boolean Masking

        Name      Item  Price
shop 2  Toms    Yippee   40.0
shop 3   Aby  Chineese   30.0

In [0]:
shops[(shops['Name']=='Tapan')&(shops['Price']<=20)]

         Name    Item  Price
shop 1  Tapan  Maggie   20.0

In [0]:
#pd.read_csv(data,index_col=specify index column,skiprows=skip no of rows in table)

In [0]:
shops.set_index([shops.index,shops.Name])
shops

         Name      Item  Price
shop 1  Tapan    Maggie   20.0
shop 2   Toms    Yippee   40.0
shop 3    Aby  Chineese   30.0